{
    "version": "https://jsonfeed.org/version/1",
    "title": "Thoughts",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Prinzipiells Denken.",
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author":  {
        "name": "apjd",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "http://localhost:4000/2020/04/06/light-matter-two-level-system",
            "title": "Light and matter - A description based on a quantum mechanical two-level system and a classical electric field",
            "summary": null,
            "content_text": "In the following we will describe the effect of light on matter based on a very simple two-level quantum mechanical system. In another post I will describe light classically.Suppose we have a simple two-level quantum mechanical system with energies  and  and the states  and . Without any external influence, these two states are completely  uncoupled as there is no reason for a particle to jump from one state to the other (we assume the ground state as the initial state). This means that  and  are time-independent and are solutions to the time-independent Schrödinger equation:Now what happens when light hits matter? The two states are now coupled! Why? Because now an electron in the ground state  can absorb energy from light (a photon) and jump to the higher energy state !To make the calculations a bit simpler, we want to treat light classically. In classical electrodynamics, light is basically an alternating electric field  and  field. For now we ignore the magnetic field .The question of the interaction of light and matter becomes: How does an alternating external electric field  does change our two-level quantum mechanical system?First, the external electric field  leads to a coupled two-level system because now a transition between the two states is possible. There is a general Ansatz for coupled quantum mechanical system: Describe the overall system as a linear combination of the uncoupled states.As we are dealing with an alternating electric field ,  and  must be time-independent. Because it can be that at a time the state  is more “favourable” and at another time the state .An external electric field  can also lead to an induced dipole moment. Without the external field normally the dipole moment vanishes in time average because of the symmetry (imagine the probability cloud for the position of an electron around the core in  state in the hydrogen atom). This means that the overall energy of the system is now the sum of the energy of the unperturbed system and the dipole moment:Now has does the overall Schrödinger equation looks like?  must now be time-dependent, as the field changes the position probability clouds of the electron from time to time. So we need to solve the time-dependent Schrödinger equation:Now what do we get for  after solving the Schrödinger equation?  and  are assumed to be known (solutions of the hydrogen atom). For  and  we get:What does this means? As  and  are time-independent, the time-dependence of the overall wave function  is determined by  and .What this means it that the electron jumps between  and  with a frequency of  ( is the frequency to see the electron in the same state again). This jumping back and forth of the electron is called the Rabi oscillation.The the value of  is: is the energy gain that we get when the external electric field induces a dipole moment (please note that  depends on the time-independent , so  is constant and only depends on the magnitude and direction of the external electric field and not its frequency. This makes  somehow characteristic to the material).Rabi oscillationWhat happens when an electron jumps back and forth between two states? When it jumps to a higher energy state it absorbs energy (a photon). When is jumps back to the lower energy state it gives back the energy, it emits a photon. How many photons are emitted after the time ? Because the electron is in the ground state with a freqeuncy of , it emits  photons. What energy do the photons have?Physicists have a name for the phenomenon that an electron emits a photon after being excited to a higher state: stimulated emission as it does not occur by itself and is induced by an external force.DampingIn real world we often cannot observe full Rabi oscillation, meaning we don’t see emission of the photons by . This is because electrons often lose their energy as heat before reaching a higher state. The probability of finding an electron in a higher states is given by: is the damping constant. This means that if we want to have more electrons in higher states, we need higher . This can be achieved by stronger external fields.",
            "content_html": "<p>In the following we will describe the effect of light on matter based on a very simple two-level quantum mechanical system. In another post I will describe light classically.</p><p>Suppose we have a simple two-level quantum mechanical system with energies <script type=\"math/tex\">E_1</script> and <script type=\"math/tex\">E_2</script> and the states <script type=\"math/tex\">\\psi_0</script> and <script type=\"math/tex\">\\psi_1</script>. Without any external influence, these two states are completely  uncoupled as there is no reason for a particle to jump from one state to the other (we assume the ground state as the initial state). This means that <script type=\"math/tex\">\\psi_0</script> and <script type=\"math/tex\">\\psi_1</script> are time-independent and are solutions to the time-independent Schrödinger equation:</p><script type=\"math/tex; mode=display\">\\begin{equation}  \\hat{H_0} \\psi_j = E_j \\psi_j\\end{equation}</script><p>Now what happens when light hits matter? The two states are now coupled! Why? Because now an electron in the ground state <script type=\"math/tex\">\\psi_0</script> can absorb energy from light (a photon) and jump to the higher energy state <script type=\"math/tex\">\\psi_1</script>!</p><p>To make the calculations a bit simpler, we want to treat light classically. In classical electrodynamics, light is basically an alternating electric field <script type=\"math/tex\">\\vec{E}</script> and <script type=\"math/tex\">\\vec{B}</script> field. For now we ignore the magnetic field <script type=\"math/tex\">\\vec{B}</script>.</p><p>The question of the interaction of light and matter becomes: How does an alternating external electric field <script type=\"math/tex\">\\vec{E}</script> does change our two-level quantum mechanical system?</p><p>First, the external electric field <script type=\"math/tex\">\\vec{E}</script> leads to a coupled two-level system because now a transition between the two states is possible. There is a general Ansatz for coupled quantum mechanical system: Describe the overall system as a linear combination of the uncoupled states.</p><script type=\"math/tex; mode=display\">\\begin{equation}  \\psi = c_1 \\psi_0 + c_2 \\psi_1\\end{equation}</script><p>As we are dealing with an alternating electric field <script type=\"math/tex\">\\vec{E}(t)</script>, <script type=\"math/tex\">c_1</script> and <script type=\"math/tex\">c_2</script> must be time-independent. Because it can be that at a time the state <script type=\"math/tex\">\\psi_0</script> is more “favourable” and at another time the state <script type=\"math/tex\">\\psi_1</script>.</p><p>An external electric field <script type=\"math/tex\">\\vec{E}</script> can also lead to an induced dipole moment. Without the external field normally the dipole moment vanishes in time average because of the symmetry (imagine the probability cloud for the position of an electron around the core in <script type=\"math/tex\">1s</script> state in the hydrogen atom). This means that the overall energy of the system is now the sum of the energy of the unperturbed system and the dipole moment:</p><script type=\"math/tex; mode=display\">\\begin{equation}  \\hat{H} = \\hat{H_0} + \\hat{H}_{dipole} = \\hat{H_0} - e\\hat{\\vec{E}} \\hat{x}\\end{equation}</script><p>Now has does the overall Schrödinger equation looks like? <script type=\"math/tex\">\\psi</script> must now be time-dependent, as the field changes the position probability clouds of the electron from time to time. So we need to solve the time-dependent Schrödinger equation:</p><script type=\"math/tex; mode=display\">\\begin{equation}  i\\hbar \\frac{\\partial \\psi}{\\partial t} = (\\hat{H_0} + \\hat{H}_{dipole}) \\psi\\end{equation}</script><p>Now what do we get for <script type=\"math/tex\">\\psi</script> after solving the Schrödinger equation? <script type=\"math/tex\">\\psi_0</script> and <script type=\"math/tex\">\\psi_1</script> are assumed to be known (solutions of the hydrogen atom). For <script type=\"math/tex\">c_1</script> and <script type=\"math/tex\">c_2</script> we get:</p><p><script type=\"math/tex\">\\begin{equation}  c_1 = \\exp{\\frac{-iE_1t}{\\hbar}} \\cos{\\omega_{rabi} t}\\end{equation}</script><script type=\"math/tex\">\\begin{equation}  c_2 = \\exp{\\frac{-iE_2t}{\\hbar}} \\sin{\\omega_{rabi} t}\\end{equation}</script><script type=\"math/tex\">\\begin{equation}  |c_1|^2 = \\cos^2{(\\omega_{rabi} t)}\\end{equation}</script><script type=\"math/tex\">\\begin{equation}  |c_2|^2 = \\sin^2{(\\omega_{rabi} t)}^2\\end{equation}</script></p><p>What does this means? As <script type=\"math/tex\">\\psi_0</script> and <script type=\"math/tex\">\\psi_1</script> are time-independent, the time-dependence of the overall wave function <script type=\"math/tex\">\\psi</script> is determined by <script type=\"math/tex\">c_1</script> and <script type=\"math/tex\">c_2</script>.</p><p>What this means it that the electron jumps between <script type=\"math/tex\">\\psi_0</script> and <script type=\"math/tex\">\\psi_1</script> with a frequency of <script type=\"math/tex\">2\\omega_{rabi}</script> (<script type=\"math/tex\">1\\omega_{rabi}</script> is the frequency to see the electron in the same state again). This jumping back and forth of the electron is called the <em>Rabi oscillation</em>.</p><p>The the value of <script type=\"math/tex\">\\omega_{Rabi}</script> is:</p><script type=\"math/tex; mode=display\">\\begin{equation}  \\omega_{Rabi} = \\frac{\\vec{E}_0 \\cdot \\vec{\\mu}_{01}}{\\hbar}\\end{equation}</script><p><script type=\"math/tex\">\\vec{E}_0 \\cdot \\vec{\\mu}_{01}</script> is the energy gain that we get when the external electric field induces a dipole moment (please note that <script type=\"math/tex\">\\omega_{Rabi}</script> depends on the time-independent <script type=\"math/tex\">\\vec{E}_0</script>, so <script type=\"math/tex\">\\omega_{Rabi}</script> is constant and only depends on the magnitude and direction of the external electric field and not its frequency. This makes <script type=\"math/tex\">\\omega_{Rabi}</script> somehow characteristic to the material).</p><h2 id=\"rabi-oscillation\">Rabi oscillation</h2><p>What happens when an electron jumps back and forth between two states? When it jumps to a higher energy state it absorbs energy (a photon). When is jumps back to the lower energy state it gives back the energy, it emits a photon. How many photons are emitted after the time <script type=\"math/tex\">t</script>? Because the electron is in the ground state with a freqeuncy of <script type=\"math/tex\">\\omega_{rabi}</script>, it emits <script type=\"math/tex\">\\omega_{rabi} \\times 2\\pi \\times t</script> photons. What energy do the photons have?</p><script type=\"math/tex; mode=display\">\\hbar \\omega_{photon} = E_2 - E_1</script><p>Physicists have a name for the phenomenon that an electron emits a photon after being excited to a higher state: <em>stimulated emission</em> as it does not occur by itself and is induced by an external force.</p><h2 id=\"damping\">Damping</h2><p>In real world we often cannot observe full Rabi oscillation, meaning we don’t see emission of the photons by <script type=\"math/tex\">\\omega_{rabi}</script>. This is because electrons often lose their energy as heat before reaching a higher state. The probability of finding an electron in a higher states is given by:</p><script type=\"math/tex; mode=display\">\\begin{equation}  |c_2|^2 \\approx (\\frac{\\omega_{Rabi}}{2\\gamma})^2\\end{equation}</script><p><script type=\"math/tex\">\\gamma</script> is the damping constant. This means that if we want to have more electrons in higher states, we need higher <script type=\"math/tex\">\\omega_{Rabi}</script>. This can be achieved by stronger external fields.</p>",
            "url": "http://localhost:4000/2020/04/06/light-matter-two-level-system",
            
            
            
            
            
            "date_published": "2020-04-06T00:00:00+02:00",
            "date_modified": "2020-04-06T00:00:00+02:00",
            
                "author":  {
                "name": "apjd",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/04/06/light-matter-classical-description",
            "title": "Light and matter - A classical description",
            "summary": null,
            "content_text": "",
            "content_html": "",
            "url": "http://localhost:4000/2020/04/06/light-matter-classical-description",
            
            
            
            
            
            "date_published": "2020-04-06T00:00:00+02:00",
            "date_modified": "2020-04-06T00:00:00+02:00",
            
                "author":  {
                "name": "apjd",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/04/06/coupling-states-quantum-mechanics",
            "title": "The coupling of states in quantum mechanics",
            "summary": null,
            "content_text": "Consider a simple quantum mechanical system consisting of two eigenstates  and . A coupling between these two states means that there is a non-zero probability of a particle to go from one state to the other. Physically a coupling between two states is always achieved only by external influences. For example, light can couple different states in an atom. An electron can absorb a photon and go to a higher energy state, thus we can say these two states are coupled by the photon.Generally there are some physical quantity changes associated with such a transition. In simple terms: when a particle goes from one state to another state, something is changed. For example in case of photon absorption the energy of the electron will increase.How do we calculate such changes in physical quantities in quantum mechanics? Let’s consider the energy.Generally the Hamiltonian can be written as:If ,  is the energy difference between the final state  and the initial state . The sign of  determines the energy gain or loss. can be calculated by an integral:",
            "content_html": "<p>Consider a simple quantum mechanical system consisting of two eigenstates <script type=\"math/tex\">\\ket{0}</script> and <script type=\"math/tex\">\\ket{1}</script>. A coupling between these two states means that there is a non-zero probability of a particle to go from one state to the other. Physically a coupling between two states is always achieved only by external influences. For example, light can couple different states in an atom. An electron can absorb a photon and go to a higher energy state, thus we can say these two states are coupled by the photon.</p><p>Generally there are some physical quantity changes associated with such a transition. In simple terms: when a particle goes from one state to another state, something is changed. For example in case of photon absorption the energy of the electron will increase.</p><p>How do we calculate such changes in physical quantities in quantum mechanics? Let’s consider the energy.</p><p>Generally the Hamiltonian can be written as:</p><script type=\"math/tex; mode=display\">% <![CDATA[H_{fi} = \\left< f \\middle| \\hat{H} \\middle| i \\right> %]]></script><p>If <script type=\"math/tex\">f \\ne i</script>, <script type=\"math/tex\">H_{fi}</script> is the energy difference between the final state <script type=\"math/tex\">\\ket{f}</script> and the initial state <script type=\"math/tex\">\\ket{i}</script>. The sign of <script type=\"math/tex\">H_{fi}</script> determines the energy gain or loss.</p><p><script type=\"math/tex\">H_{fi}</script> can be calculated by an integral:</p><script type=\"math/tex; mode=display\">% <![CDATA[H_{fi} = \\left< f \\middle| \\hat{H} \\middle| i \\right> = \\int{\\psi_f^* \\hat{H} \\psi_i dx} %]]></script>",
            "url": "http://localhost:4000/2020/04/06/coupling-states-quantum-mechanics",
            
            
            
            
            
            "date_published": "2020-04-06T00:00:00+02:00",
            "date_modified": "2020-04-06T00:00:00+02:00",
            
                "author":  {
                "name": "apjd",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/04/05/meaning-electric-displacement",
            "title": "The meaning of the Electric Displacement",
            "summary": null,
            "content_text": "Consider the simplest capacitor as shown in the figure. Between the two plates a dielectric material (non-conductor) is placed. As the electric field of the capacitor passes through the material, it induces electric dipole moments. The sum of the induced dipole moments per volume is called Polarization:,with  being the distance between the positive core of the atom and the electron with charge  and volume .Now these small dipole moments are microscopic capacitors by themselves and induce an electrical field that has the opposite direction compared to the external electric field. This leads to a decreased electric field inside of the material.The strength of the field inside the material is described by the electric Displacement : has the unit of charge per area.Now the polasization by itself depends on the external field: is material-dependent and describes how “easily” can dipole moments be induced in the material. With this equation we get for the electric displacement:We define the relative permeability as  and finally get for the displacement field:This equation describes the strength of the electric field inside a material.",
            "content_html": "<p>Consider the simplest capacitor as shown in the figure. Between the two plates a dielectric material (non-conductor) is placed. As the electric field of the capacitor passes through the material, it induces electric dipole moments. The sum of the induced dipole moments per volume is called <em>Polarization</em>:</p><p><script type=\"math/tex\">P = \\frac{\\sum{ex(t)}}{V}</script>,</p><p>with <script type=\"math/tex\">x(t)</script> being the distance between the positive core of the atom and the electron with charge <script type=\"math/tex\">e</script> and volume <script type=\"math/tex\">V</script>.</p><p>Now these small dipole moments are microscopic capacitors by themselves and induce an electrical field that has the opposite direction compared to the external electric field. This leads to a decreased electric field inside of the material.</p><p>The strength of the field inside the material is described by the <em>electric Displacement</em> <script type=\"math/tex\">D</script>:</p><script type=\"math/tex; mode=display\">D = \\epsilon_0 E + P</script><p><script type=\"math/tex\">D</script> has the unit of charge per area.</p><p>Now the polasization by itself depends on the external field:</p><script type=\"math/tex; mode=display\">P = \\epsilon_0 \\chi E</script><p><script type=\"math/tex\">\\chi</script> is material-dependent and describes how “easily” can dipole moments be induced in the material. With this equation we get for the electric displacement:</p><script type=\"math/tex; mode=display\">D = E(\\epsilon_0 + \\epsilon_0 \\chi)</script><p>We define the relative permeability as <script type=\"math/tex\">\\epsilon = 1 + \\chi</script> and finally get for the displacement field:</p><script type=\"math/tex; mode=display\">D = \\epsilon_0 \\epsilon E</script><p>This equation describes the strength of the electric field inside a material.</p><p><img src=\"/assets/images/capacitor.svg\" alt=\"capacitor\" height=\"50%\" width=\"50%\" /></p>",
            "url": "http://localhost:4000/2020/04/05/meaning-electric-displacement",
            
            
            
            
            
            "date_published": "2020-04-05T00:00:00+02:00",
            "date_modified": "2020-04-05T00:00:00+02:00",
            
                "author":  {
                "name": "apjd",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/04/05/importance-of-exponential-functions",
            "title": "The use of exponential functions in everyday life",
            "summary": null,
            "content_text": "Exponential functions are an important class of mathematical functions. Generally they are defined as the solutions of the following differential equation:,where  is a constant and  is a variable, for example time. This means that exponential functions describe situations where the rate of change of something depends on how much of that something is currently available. The rate of change basically answers the question: How many new things do I get after a specific time?An example is the spreading of a contagious disease. The number of people that get sick after a certain period of time, for example after one day, depends on how many people already have the disease.Another example is the growth of money due to the interest rate. The amount of money that is added to my money after one year depends on how much money I already have in my bank account.",
            "content_html": "<p>Exponential functions are an important class of mathematical functions. Generally they are defined as the solutions of the following differential equation:</p><p><script type=\"math/tex\">\\frac{df(t)}{dt} = C f(t)</script>,</p><p>where <script type=\"math/tex\">C</script> is a constant and <script type=\"math/tex\">t</script> is a variable, for example time. This means that exponential functions describe situations where the rate of change of something depends on how much of that something is currently available. The rate of change basically answers the question: How many new things do I get after a specific time?</p><p>An example is the spreading of a contagious disease. The number of people that get sick after a certain period of time, for example after one day, depends on how many people already have the disease.</p><p>Another example is the growth of money due to the interest rate. The amount of money that is added to my money after one year depends on how much money I already have in my bank account.</p>",
            "url": "http://localhost:4000/2020/04/05/importance-of-exponential-functions",
            
            
            
            
            
            "date_published": "2020-04-05T00:00:00+02:00",
            "date_modified": "2020-04-05T00:00:00+02:00",
            
                "author":  {
                "name": "apjd",
                "url": null,
                "avatar": null
                }
                
            
        }
    
    ]
}